---
kind: property
id: P:Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionSigmaProfile.MiddleBendLength
source: html/eb3b429a-88ab-0a80-48c6-6683379e4577.htm
---
# Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionSigmaProfile.MiddleBendLength Property

Middle Bend segment length.

## Syntax (C#)
```csharp
public double MiddleBendLength { get; set; }
```